<a href="https://colab.research.google.com/github/sureshmecad/Google-Colab/blob/master/6_New_Column_Multiply_Divide.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### **1) Multiplication**

In [1]:
import pandas as pd

In [2]:
data = {'Month': ['July', 'August', 'September', 'October', 'November', 'December'],
        'Hours': [15, 32, 19, 10, 45, 19]}

df = pd.DataFrame(data)
df.head()

       Month  Hours
0       July     15
1     August     32
2  September     19
3    October     10
4   November     45

In [3]:
df['Minites'] = df['Hours'] * 60
df

       Month  Hours  Minites
0       July     15      900
1     August     32     1920
2  September     19     1140
3    October     10      600
4   November     45     2700
5   December     19     1140

### **2) Division**

In [5]:
data = {'Gender': ['Male', 'Male', 'Female', 'Female', 'Male', 'Male'],
        'Height': [174, 189, 185, 195, 149, 160],
        'Weight': [96, 87, 110, 104, 61, 50],
        'Index': [4, 2, 4, 3, 3, 5]}

df1 = pd.DataFrame(data)
df1.head()

   Gender  Height  Weight  Index
0    Male     174      96      4
1    Male     189      87      2
2  Female     185     110      4
3  Female     195     104      3
4    Male     149      61      3

- Lets create **2 new features** in our data.

- **'Height_meters'** which will have **height in meters** instead of **cm**

- **'calculated_BMI'**, which will have BMI for each record

       BMI = weight (kg) รท height2 (m)

In [9]:
# We need to calculate BMI which can be done using Height and Weight features
df1['Height_meters'] = df1['Height'] / 100
df1['calculated_BMI'] = (df1['Weight'] / df1['Height_meters']**2)
df1.head()

   Gender  Height  Weight  Index  Height_meters  calculated_BMI
0    Male     174      96      4           1.74       31.708284
1    Male     189      87      2           1.89       24.355421
2  Female     185     110      4           1.85       32.140248
3  Female     195     104      3           1.95       27.350427
4    Male     149      61      3           1.49       27.476240